### 张思辉   男 | 求职意向：后端/软件开发工程师 
湖北大学  |  计算机科学与技术  |  本科
电话/微信: 187-1264-0793  |  邮箱: zhang_sihui@qq.com
Github: https://github.com/zhang-sihui
#### 主要技能
1.后端基础：掌握Python基础，熟练使用集成开发工具PyCharm的基本功能，了解Python Web框架Django。
2.前端基础：了解HTML、CSS和JavaScript基础。
3.版本管理：了解git基本操作。
4.数据库：了解MySQL、Redis基础。
5.其他工具：Linux操作系统的简单使用。
#### 教育经历
##### 湖北大学											2016年9月–2020年7月
计算机科学与技术-本科-计算机与信息工程学院
1．主修课程：Python程序设计、数据结构、计算机网络、操作系统、数据库系统原理等。
2．英语四级CET-4。
#### 项目经历
##### 个人网站
项目描述：独立开发基于Python Web框架Django个人网站，仍在完善中。
1.文件上传下载：实现文件的上传与下载功能，文件处理中chunks更快的大文件处理能力。
2.用户登录功能：用户注册、登录及用户安全保护。
3.文章编辑功能：富文本编辑器编辑、修改等操作，文章分类、搜索。
4.图片展示功能：展示个人上传的图片。
5.访问留言功能：留言以交流。
6.个人观看记录：一个简单的个人观看清单。
##### 课程项目 
1．使用 Python Web 框架 Django，独立完成一个简单的博客系统，实现连接数据库，用户注册、登 录等功能，编辑、修改、删除博客等功能。
2．数据库实用技术课程设计中，MySQL 数据库的创建，表的构造，数据的简单查询与索引查询。
#### 个人网站
网站地址：https://zhangsihui.pythonanywhere.com/

